exp_roomWT/hotRoom3/0/k.orig0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    building
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    wtwalls
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    inlet
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    outlet
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
