exp_roomWT/hotRoom3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    building
    {
        type            walls;
        physicalType    walls;
        nFaces          0;
        startFace       26097;
    }
    wtwalls
    {
        type            walls;
        physicalType    walls;
        nFaces          3154;
        startFace       26097;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          532;
        startFace       29251;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          532;
        startFace       29783;
    }
)

// ************************************************************************* //
